import MainImage1 from "../assets/company/main_project_1.png";
import MainImage2 from "../assets/company/main_project_2.png";
import MainImage3 from "../assets/company/main_project_3.png";
import MainImage4 from "../assets/company/main_project_4.png";
import MainImage5 from "../assets/company/main_project_5.png";
import MainImage6 from "../assets/company/main_project_6.png";

import GalleryImage1 from '../assets/company/gallery1.png'
import GalleryImage2 from '../assets/company/gallery2.png'
import GalleryImage3 from '../assets/company/gallery3.png'
import GalleryImage4 from '../assets/company/gallery4.png'
import { Review } from "./components/Comments";

const data = [
    {
        id: 1,
        title: "شقة للتمليك في شارع السند ، حي النرجس ، الرياض ، امارة منطقة الرياض",
        image: MainImage1,
        gallery: [GalleryImage1, GalleryImage2, GalleryImage3, GalleryImage4],
        statusOld: "جديد",
        statusApproved: "مقبول",
        statusPaid: "مدفوع",
        price: "85,000",
        priceType: "ريال سعودي",
        description: {
            short: "شقة جديدة للتمليك بحي النرجس شارع السند شقق ألما ",
            long: "تتكون من صالة ومجلس وثلاث غرف نوم ( منها وحده منها ماستر ) ومطبخ وثلاث دورات مياه وتراس  مطل على الشارع  بمساحة 138م مجهزة بأحدث التقنيات الذكية ومكيفة بالكامل مع مطبخ مجهز من فرن كهربائي  وشواية ومكرويف وغسالة صحون  في الدور الأول في عمارة سكنية فاخرة بواجهات عصرية وممرات رخامية ومواقف واسعة بمنطقة حيوية بالقرب من أهم المعالم الأساسية بمدينة الرياض",
            properties: [
                "تكييف كامل بأربع وحدات ذكية على نظام wife وسخانات مياه",
                "مطبخ جاهز مصمم بشكل عصري مجهز بكاونتر خدمة ومكان لغسيل الملابس",
                "قفل ذكي ونظام سمارت متكامل ",
                "مهيئة بجميع وسائل السلامة ومزودة بنظام أمني عالي",
                "اضاءة LED تعمل باللمس",
                "تتمتع بالإضاءة الطبيعة من خلال النوافذ الواسعة",
                "مؤسسة بأحدث مواد البناء وتقنيات العزل المائي والحراري والأجباس المقاومة للحرائق والرطوبة",
                "موقف خاص واسع بجوار المدخل الرئيسي",
                "اطلالة جنوبية على شارع هادئ بجوار منطقة سكنية مكتملة الخدمات",
                "تقع بالقرب من حديقة الحي وبجوار المسجد على بعد مئة متر مشيا على الاقدام",
                "تبعد الشقة مسافة 5 دقائق عن جامعة الامام محمد بن سعود الاسلامية وجامعة الأميرة ورة ومسافة 12 دقيقة عن مطار الملك خالد",
                "سداد فاتورة الكهرباء والمياه لمدة سنة من تاريخ الملكية ",
                "صيانة مجانية للمساحات المشتركة لمدة سنة من تاريخ الملكية",
            ],
        },
        info : {
            type: 'عقار سكني',
            space: '150م',
            city: 'الرياض',
            region :'حي النرجس'
        }
    },
    {
        id: 2,
        title: "شقة للتمليك في شارع السند ، حي النرجس ، الرياض ، امارة منطقة الرياض",
        image: MainImage2,
        gallery: [GalleryImage1, GalleryImage2, GalleryImage3, GalleryImage4],
        statusOld: "جديد",
        statusApproved: "مقبول",
        statusPaid: "مدفوع",
        price: "85,000",
        priceType: "ريال سعودي",
        description: {
            short: "شقة جديدة للتمليك بحي النرجس شارع السند شقق ألما ",
            long: "تتكون من صالة ومجلس وثلاث غرف نوم ( منها وحده منها ماستر ) ومطبخ وثلاث دورات مياه وتراس  مطل على الشارع  بمساحة 138م مجهزة بأحدث التقنيات الذكية ومكيفة بالكامل مع مطبخ مجهز من فرن كهربائي  وشواية ومكرويف وغسالة صحون  في الدور الأول في عمارة سكنية فاخرة بواجهات عصرية وممرات رخامية ومواقف واسعة بمنطقة حيوية بالقرب من أهم المعالم الأساسية بمدينة الرياض",
            properties: [
                "تكييف كامل بأربع وحدات ذكية على نظام wife وسخانات مياه",
                "مطبخ جاهز مصمم بشكل عصري مجهز بكاونتر خدمة ومكان لغسيل الملابس",
                "قفل ذكي ونظام سمارت متكامل ",
                "مهيئة بجميع وسائل السلامة ومزودة بنظام أمني عالي",
                "اضاءة LED تعمل باللمس",
                "تتمتع بالإضاءة الطبيعة من خلال النوافذ الواسعة",
                "مؤسسة بأحدث مواد البناء وتقنيات العزل المائي والحراري والأجباس المقاومة للحرائق والرطوبة",
                "موقف خاص واسع بجوار المدخل الرئيسي",
                "اطلالة جنوبية على شارع هادئ بجوار منطقة سكنية مكتملة الخدمات",
                "تقع بالقرب من حديقة الحي وبجوار المسجد على بعد مئة متر مشيا على الاقدام",
                "تبعد الشقة مسافة 5 دقائق عن جامعة الامام محمد بن سعود الاسلامية وجامعة الأميرة ورة ومسافة 12 دقيقة عن مطار الملك خالد",
                "سداد فاتورة الكهرباء والمياه لمدة سنة من تاريخ الملكية ",
                "صيانة مجانية للمساحات المشتركة لمدة سنة من تاريخ الملكية",
            ],
        },
        info : {
            type: 'عقار سكني',
            space: '150م',
            city: 'الرياض',
            region :'حي النرجس'
        }
    },
    {
        id: 3,
        title: "شقة للتمليك في شارع السند ، حي النرجس ، الرياض ، امارة منطقة الرياض",
        image: MainImage3,
        gallery: [GalleryImage1, GalleryImage2, GalleryImage3, GalleryImage4],
        statusOld: "جديد",
        statusApproved: "مرفوض",
        statusPaid: "مدفوع",
        price: "85,000",
        priceType: "ريال سعودي",
        description: {
            short: "شقة جديدة للتمليك بحي النرجس شارع السند شقق ألما ",
            long: "تتكون من صالة ومجلس وثلاث غرف نوم ( منها وحده منها ماستر ) ومطبخ وثلاث دورات مياه وتراس  مطل على الشارع  بمساحة 138م مجهزة بأحدث التقنيات الذكية ومكيفة بالكامل مع مطبخ مجهز من فرن كهربائي  وشواية ومكرويف وغسالة صحون  في الدور الأول في عمارة سكنية فاخرة بواجهات عصرية وممرات رخامية ومواقف واسعة بمنطقة حيوية بالقرب من أهم المعالم الأساسية بمدينة الرياض",
            properties: [
                "تكييف كامل بأربع وحدات ذكية على نظام wife وسخانات مياه",
                "مطبخ جاهز مصمم بشكل عصري مجهز بكاونتر خدمة ومكان لغسيل الملابس",
                "قفل ذكي ونظام سمارت متكامل ",
                "مهيئة بجميع وسائل السلامة ومزودة بنظام أمني عالي",
                "اضاءة LED تعمل باللمس",
                "تتمتع بالإضاءة الطبيعة من خلال النوافذ الواسعة",
                "مؤسسة بأحدث مواد البناء وتقنيات العزل المائي والحراري والأجباس المقاومة للحرائق والرطوبة",
                "موقف خاص واسع بجوار المدخل الرئيسي",
                "اطلالة جنوبية على شارع هادئ بجوار منطقة سكنية مكتملة الخدمات",
                "تقع بالقرب من حديقة الحي وبجوار المسجد على بعد مئة متر مشيا على الاقدام",
                "تبعد الشقة مسافة 5 دقائق عن جامعة الامام محمد بن سعود الاسلامية وجامعة الأميرة ورة ومسافة 12 دقيقة عن مطار الملك خالد",
                "سداد فاتورة الكهرباء والمياه لمدة سنة من تاريخ الملكية ",
                "صيانة مجانية للمساحات المشتركة لمدة سنة من تاريخ الملكية",
            ],
        },
        info : {
            type: 'عقار سكني',
            space: '150م',
            city: 'الرياض',
            region :'حي النرجس'
        }
    },
    {
        id: 4,
        title: "شقة للتمليك في شارع السند ، حي النرجس ، الرياض ، امارة منطقة الرياض",
        image: MainImage4,
        gallery: [GalleryImage1, GalleryImage2, GalleryImage3, GalleryImage4],
        statusOld: "جديد",
        statusApproved: "مقبول",
        statusPaid: "مدفوع",
        price: "85,000",
        priceType: "ريال سعودي",
        description: {
            short: "شقة جديدة للتمليك بحي النرجس شارع السند شقق ألما ",
            long: "تتكون من صالة ومجلس وثلاث غرف نوم ( منها وحده منها ماستر ) ومطبخ وثلاث دورات مياه وتراس  مطل على الشارع  بمساحة 138م مجهزة بأحدث التقنيات الذكية ومكيفة بالكامل مع مطبخ مجهز من فرن كهربائي  وشواية ومكرويف وغسالة صحون  في الدور الأول في عمارة سكنية فاخرة بواجهات عصرية وممرات رخامية ومواقف واسعة بمنطقة حيوية بالقرب من أهم المعالم الأساسية بمدينة الرياض",
            properties: [
                "تكييف كامل بأربع وحدات ذكية على نظام wife وسخانات مياه",
                "مطبخ جاهز مصمم بشكل عصري مجهز بكاونتر خدمة ومكان لغسيل الملابس",
                "قفل ذكي ونظام سمارت متكامل ",
                "مهيئة بجميع وسائل السلامة ومزودة بنظام أمني عالي",
                "اضاءة LED تعمل باللمس",
                "تتمتع بالإضاءة الطبيعة من خلال النوافذ الواسعة",
                "مؤسسة بأحدث مواد البناء وتقنيات العزل المائي والحراري والأجباس المقاومة للحرائق والرطوبة",
                "موقف خاص واسع بجوار المدخل الرئيسي",
                "اطلالة جنوبية على شارع هادئ بجوار منطقة سكنية مكتملة الخدمات",
                "تقع بالقرب من حديقة الحي وبجوار المسجد على بعد مئة متر مشيا على الاقدام",
                "تبعد الشقة مسافة 5 دقائق عن جامعة الامام محمد بن سعود الاسلامية وجامعة الأميرة ورة ومسافة 12 دقيقة عن مطار الملك خالد",
                "سداد فاتورة الكهرباء والمياه لمدة سنة من تاريخ الملكية ",
                "صيانة مجانية للمساحات المشتركة لمدة سنة من تاريخ الملكية",
            ],
        },
        info : {
            type: 'عقار سكني',
            space: '150م',
            city: 'الرياض',
            region :'حي النرجس'
        }
    },
    {
        id: 5,
        title: "شقة للتمليك في شارع السند ، حي النرجس ، الرياض ، امارة منطقة الرياض",
        image: MainImage5,
        gallery: [GalleryImage1, GalleryImage2, GalleryImage3, GalleryImage4],
        statusOld: "جديد",
        statusApproved: "مرفوض",
        statusPaid: "مدفوع",
        price: "85,000",
        priceType: "ريال سعودي",
        description: {
            short: "شقة جديدة للتمليك بحي النرجس شارع السند شقق ألما ",
            long: "تتكون من صالة ومجلس وثلاث غرف نوم ( منها وحده منها ماستر ) ومطبخ وثلاث دورات مياه وتراس  مطل على الشارع  بمساحة 138م مجهزة بأحدث التقنيات الذكية ومكيفة بالكامل مع مطبخ مجهز من فرن كهربائي  وشواية ومكرويف وغسالة صحون  في الدور الأول في عمارة سكنية فاخرة بواجهات عصرية وممرات رخامية ومواقف واسعة بمنطقة حيوية بالقرب من أهم المعالم الأساسية بمدينة الرياض",
            properties: [
                "تكييف كامل بأربع وحدات ذكية على نظام wife وسخانات مياه",
                "مطبخ جاهز مصمم بشكل عصري مجهز بكاونتر خدمة ومكان لغسيل الملابس",
                "قفل ذكي ونظام سمارت متكامل ",
                "مهيئة بجميع وسائل السلامة ومزودة بنظام أمني عالي",
                "اضاءة LED تعمل باللمس",
                "تتمتع بالإضاءة الطبيعة من خلال النوافذ الواسعة",
                "مؤسسة بأحدث مواد البناء وتقنيات العزل المائي والحراري والأجباس المقاومة للحرائق والرطوبة",
                "موقف خاص واسع بجوار المدخل الرئيسي",
                "اطلالة جنوبية على شارع هادئ بجوار منطقة سكنية مكتملة الخدمات",
                "تقع بالقرب من حديقة الحي وبجوار المسجد على بعد مئة متر مشيا على الاقدام",
                "تبعد الشقة مسافة 5 دقائق عن جامعة الامام محمد بن سعود الاسلامية وجامعة الأميرة ورة ومسافة 12 دقيقة عن مطار الملك خالد",
                "سداد فاتورة الكهرباء والمياه لمدة سنة من تاريخ الملكية ",
                "صيانة مجانية للمساحات المشتركة لمدة سنة من تاريخ الملكية",
            ],
        },
        info : {
            type: 'عقار سكني',
            space: '150م',
            city: 'الرياض',
            region :'حي النرجس'
        }
    },
    {
        id: 6,
        title: "شقة للتمليك في شارع السند ، حي النرجس ، الرياض ، امارة منطقة الرياض",
        image: MainImage6,
        gallery: [GalleryImage1, GalleryImage2, GalleryImage3, GalleryImage4],
        statusOld: "جديد",
        statusApproved: "مقبول",
        statusPaid: "مدفوع",
        price: "85,000",
        priceType: "ريال سعودي",
        description: {
            short: "شقة جديدة للتمليك بحي النرجس شارع السند شقق ألما ",
            long: "تتكون من صالة ومجلس وثلاث غرف نوم ( منها وحده منها ماستر ) ومطبخ وثلاث دورات مياه وتراس  مطل على الشارع  بمساحة 138م مجهزة بأحدث التقنيات الذكية ومكيفة بالكامل مع مطبخ مجهز من فرن كهربائي  وشواية ومكرويف وغسالة صحون  في الدور الأول في عمارة سكنية فاخرة بواجهات عصرية وممرات رخامية ومواقف واسعة بمنطقة حيوية بالقرب من أهم المعالم الأساسية بمدينة الرياض",
            properties: [
                "تكييف كامل بأربع وحدات ذكية على نظام wife وسخانات مياه",
                "مطبخ جاهز مصمم بشكل عصري مجهز بكاونتر خدمة ومكان لغسيل الملابس",
                "قفل ذكي ونظام سمارت متكامل ",
                "مهيئة بجميع وسائل السلامة ومزودة بنظام أمني عالي",
                "اضاءة LED تعمل باللمس",
                "تتمتع بالإضاءة الطبيعة من خلال النوافذ الواسعة",
                "مؤسسة بأحدث مواد البناء وتقنيات العزل المائي والحراري والأجباس المقاومة للحرائق والرطوبة",
                "موقف خاص واسع بجوار المدخل الرئيسي",
                "اطلالة جنوبية على شارع هادئ بجوار منطقة سكنية مكتملة الخدمات",
                "تقع بالقرب من حديقة الحي وبجوار المسجد على بعد مئة متر مشيا على الاقدام",
                "تبعد الشقة مسافة 5 دقائق عن جامعة الامام محمد بن سعود الاسلامية وجامعة الأميرة ورة ومسافة 12 دقيقة عن مطار الملك خالد",
                "سداد فاتورة الكهرباء والمياه لمدة سنة من تاريخ الملكية ",
                "صيانة مجانية للمساحات المشتركة لمدة سنة من تاريخ الملكية",
            ],
        },
        info : {
            type: 'عقار سكني',
            space: '150م',
            city: 'الرياض',
            region :'حي النرجس'
        }
    },
    {
        id: 7,
        title: "شقة للتمليك في شارع السند ، حي النرجس ، الرياض ، امارة منطقة الرياض",
        image: MainImage1,
        gallery: [GalleryImage1, GalleryImage2, GalleryImage3, GalleryImage4],
        statusOld: "جديد",
        statusApproved: "مقبول",
        statusPaid: "مدفوع",
        price: "85,000",
        priceType: "ريال سعودي",
        description: {
            short: "شقة جديدة للتمليك بحي النرجس شارع السند شقق ألما ",
            long: "تتكون من صالة ومجلس وثلاث غرف نوم ( منها وحده منها ماستر ) ومطبخ وثلاث دورات مياه وتراس  مطل على الشارع  بمساحة 138م مجهزة بأحدث التقنيات الذكية ومكيفة بالكامل مع مطبخ مجهز من فرن كهربائي  وشواية ومكرويف وغسالة صحون  في الدور الأول في عمارة سكنية فاخرة بواجهات عصرية وممرات رخامية ومواقف واسعة بمنطقة حيوية بالقرب من أهم المعالم الأساسية بمدينة الرياض",
            properties: [
                "تكييف كامل بأربع وحدات ذكية على نظام wife وسخانات مياه",
                "مطبخ جاهز مصمم بشكل عصري مجهز بكاونتر خدمة ومكان لغسيل الملابس",
                "قفل ذكي ونظام سمارت متكامل ",
                "مهيئة بجميع وسائل السلامة ومزودة بنظام أمني عالي",
                "اضاءة LED تعمل باللمس",
                "تتمتع بالإضاءة الطبيعة من خلال النوافذ الواسعة",
                "مؤسسة بأحدث مواد البناء وتقنيات العزل المائي والحراري والأجباس المقاومة للحرائق والرطوبة",
                "موقف خاص واسع بجوار المدخل الرئيسي",
                "اطلالة جنوبية على شارع هادئ بجوار منطقة سكنية مكتملة الخدمات",
                "تقع بالقرب من حديقة الحي وبجوار المسجد على بعد مئة متر مشيا على الاقدام",
                "تبعد الشقة مسافة 5 دقائق عن جامعة الامام محمد بن سعود الاسلامية وجامعة الأميرة ورة ومسافة 12 دقيقة عن مطار الملك خالد",
                "سداد فاتورة الكهرباء والمياه لمدة سنة من تاريخ الملكية ",
                "صيانة مجانية للمساحات المشتركة لمدة سنة من تاريخ الملكية",
            ],
        },
        info : {
            type: 'عقار سكني',
            space: '150م',
            city: 'الرياض',
            region :'حي النرجس'
        }
    },
];

export default data;
export const drawerOptions = [
    { id: 1, name: " أحمد محمد", 
      additionalInfo: "رسام مصمم في الهندسة المعمارية , يقيم في الرياض , بيانات اخري.",
      type: "drawer" ,
      },

    { id: 2, name: "محمد علي", 
      additionalInfo: "رسام مصمم في الهندسة المعمارية , يقيم في الرياض , بيانات اخري.رسام محترف جدا محترف اوي محترف باحتراف", 
      type: "drawer",
      }
  ];

export const reviewerOptions = [
    { id: 3,
      name: "هشام سعد",
      additionalInfo: "مهندس مدني محترف بخبرة كبير في مجال الإنشاءات",
      type: "reviewer" },
    { id: 4,
      name: "محمد علي",
      additionalInfo: "رسام مصمم في الهندسة المعمارية , يقيم في الرياض , بيانات اخري.رسام محترف جدا محترف اوي محترف باحتراف", 
      type: "drawer" }
  ];

export const allReviews: Review[] = [
      {
        id: 1,
        content: "عقار رائع جدًا! أنصح به.",
        user: {
          id: 101,
          name: "أحمد محمد",
          avatar: "/src/assets/avatar.png",
        },
        projectId: "1",
      },
      {
        id: 2,
        content: "المكان نظيف ولكن السعر مرتفع قليلاً.",
        user: {
          id: 102,
          name: "سارة خالد",
          avatar: "/src/assets/avatar.png",
        },
        projectId: "2",
      },
      {
        id: 3,
        content: "موقع مثالي وقريب من جميع الخدمات.",
        user: {
          id: 103,
          name: "خالد علي",
          avatar: "/src/assets/avatar.png",
        },
        projectId: "1",
      },
    ];
    export const staticTeamData: Record<string, { id: number; name: string; type: string }[]> = {
        "1": [
          { id: 1, name: "أحمد محمد", type: "Reviewer" },
          { id: 2, name: "سارة علي", type: "Drawer" },
        ],
        "2": [
          { id: 3, name: "خالد حسن", type: "Reviewer" },
          { id: 4, name: "منى سعيد", type: "Reviewer" },
          { id: 5, name: "حسام بدر", type: "Drawer" },
        ],
        "3": [
          { id: 6, name: "عبدالله فريد", type: "Drawer" },
          { id: 7, name: "ياسمين عمر", type: "Reviewer" },
        ],
      };