import React from "react";

const TermsAndConditions: React.FC = () => {
  return (
    <div className="p-8 text-right w-full" dir="rtl">
        
      <h1 className="text-2xl font-bold text-[#B07D5E] mb-4 text-center">شروط وأحكام</h1>

      <p className="  leading-loose mb-6">
        تدرك شركة قيم للخدمات العقارية، وفروعها والشركات التابعة والمرتبطة بها أو مسؤوليها أو وكلائها أو الجهات التابعة لها أو من تتنازل لهم (يُشار إليها مجتمعة باسم "الشركة" أو "نحن" أو "ضمير المتكلم/الملكية")، أهمية خصوصية البيانات بالنسبة لك. لذا قمنا بإعداد هذه السياسة لمساعدتكم في تفهم طبيعة جمع واستخدام ومشاركة وكيفية التعامل مع هذه البيانات عند زيارتك أو استخدامك لمواقعنا. يرجى قراءة سياسة الخصوصية هذه بعناية عند دخولك و/أو استخدامك الموقع.
      </p>

      <h2 className="text-xl font-semibold mt-6 mb-2 relative after:block after:h-[3px] after:w-[150px] after:bg-gradient-to-r after:from-[#C29062] after:to-[#000000]  after:absolute after:bottom-[-4px] after:right-0">جمع معلوماتك</h2>
      <p className="leading-loose">
    تشمل التي قد نجمعها عنك ("المعلومات الشخصية")، على سبيل المثال لا الحصر، ما يلي:
      </p>
      <ul className="pr-6 space-y-2 list-disc marker:text-[#C29062] marker:text-2xl">
  <li>معلوماتك الخاصة وتتضمن اسمك ورقم هاتفك وبريدك الإلكتروني وبيانات الدفع الخاصة بك</li>
  <li>أي معلومات أو المستندات أو منشورات يتم مشاركتها بواسطتك عبر الموقع.</li>
  <li>المعلومات الخاصة باهتماماتك حسب نشاطك على الموقع.</li>
  <li>عنوان بروتوكول الإنترنت (IP).</li>
  <li>معلومات خاصة بالجهاز، مثل (طراز الجهاز، وإصدار نظام التشغيل، ومعرفات الجهاز الفريدة، ومعلومات شبكة الهاتف الجوال بما في ذلك رقم الهاتف).</li>
</ul>

      <h2 className="text-xl font-semibold ps-10 mt-6 mb-2 relative after:block after:h-[3px] after:w-[150px] after:bg-gradient-to-r after:from-[#C29062] after:to-[#000000]  after:absolute after:bottom-[-4px] after:right-0">
  الأمان
</h2>

      <p className="  leading-loose">
إن حماية "معلوماتك الشخصية" ومنع الاطلاع غير المصرح به يعتبر أولوية قصوى بالنسبة لنا، ونحن نتخذ جميع الخطوات الضرورية في حدود المعقول لحمايتها من استخدام اختراق أو استخدام أو تعديل أو كشف أو إتلاف دون تصريح. وعلى الرغم من هذه التدابير الاحتياطية، فلا نستطيع أن تضمن عدم وصول الأشخاص غير المصرح لهم إلى بياناتك الشخصية، كما أننا لا نتحمل المسؤولية أي دخول غير مصرح به من جانب أطراف خارجية ولا نضمن الحماية والتأمين الكاملين للمعلومات الشخصية التي تقدمونها لنا.
      </p>
    </div>
  );
};

export default TermsAndConditions;
